In [25]:
import numpy as np
import pandas as pd

In [26]:
#The data is provided in the form of a csv file. Data from the csv file is converted into a dataframe for analysis using python.
data_frame = pd.read_csv('adult.data.csv')
#All the column names are freed from the unnecessary spaces around them to make calling of the columns easier later on.
list_=[]
for col in data_frame.columns:
    col_=col.strip()
    list_.append(col_)
data_frame.columns=list_

In [28]:
#The data is displayed in the form of datframe
data_frame

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [29]:
#All the column names are freed from the unnecessary spaces around them.
list0 = []
for entry in data_frame['race']:
    entry = entry.strip()
    list0.append(entry)
data_frame['race']=list0
data_frame['race']

0        White
1        White
2        White
3        Black
4        Black
         ...
32556    White
32557    White
32558    White
32559    White
32560    White
Name: race, Length: 32561, dtype: object

In [30]:
#The following piece of code is run to know the different races of people in the datframe.
data_frame['race'].unique()

array(['White', 'Black', 'Asian-Pac-Islander', 'Amer-Indian-Eskimo',
       'Other'], dtype=object)

In [31]:
#Number of white people.
Number_of_White_People = data_frame['race'][data_frame['race'] == 'White'].count()
Number_of_White_People

27816

In [32]:
#Number of Black People
Number_of_Black_People = data_frame['race'][data_frame['race'] == 'Black'].count()
Number_of_Black_People

3124

In [33]:
#Number of Asian_Pac_Islander People
Number_of_Asian_Pac_Islander_People = data_frame['race'][data_frame['race'] == 'Asian-Pac-Islander'].count()
Number_of_Asian_Pac_Islander_People

1039

In [34]:
#Numberc of Amer_Indian_Eskimo People
Number_of_Amer_Indian_Eskimo_People = data_frame['race'][data_frame['race'] == 'Amer-Indian-Eskimo'].count()
Number_of_Amer_Indian_Eskimo_People

311

In [35]:
#Number of Other People
Number_of_Other_People = data_frame['race'][data_frame['race'] == 'Other'].count()
Number_of_Other_People

271

In [36]:
#Number of people belonging to each race displayed in tabular form.
Solution1 = pd.Series([Number_of_White_People,Number_of_Black_People,Number_of_Asian_Pac_Islander_People,Number_of_Amer_Indian_Eskimo_People,Number_of_Other_People], index=['White','Black','Asian_Pac_Islander','Amer_Indian_Eskimo','Other'])
Solution1

White                 27816
Black                  3124
Asian_Pac_Islander     1039
Amer_Indian_Eskimo      311
Other                   271
dtype: int64

In [37]:
#Average age of all the men.
Solution2 = np.mean(data_frame['age'])
Solution2

38.58164675532078

In [38]:
#Percentage of people of who have Bachelor's degree.
list2 = []
for edu in data_frame['education']:
    edu_ = edu.strip()
    list2.append(edu_)

data_frame['education'] = list2

Solution3_ = (data_frame['education'][data_frame['education'] == 'Bachelors'].count()/data_frame['education'].count())*100 
Solution3 = f'{Solution3_}' + '%'
Solution3

'16.44605509658794%'

In [39]:
#Percentage of people that have Bachelors, Masters, or Doctorate degree and make more than 50K.
list3 = []
for sal in data_frame['salary']:
    sal_ = sal.strip()
    list3.append(sal_)

data_frame['salary'] = list3
data_frame['salary']

0        <=50K
1        <=50K
2        <=50K
3        <=50K
4        <=50K
         ...
32556    <=50K
32557     >50K
32558    <=50K
32559    <=50K
32560     >50K
Name: salary, Length: 32561, dtype: object

In [40]:
#Percentage of people with the degree of Bachelors, Masters, or Doctorate who make more than 50K
Solution5 = (data_frame['salary'][
    ((data_frame['education'] == 'Bachelors') | (data_frame['education'] == 'Masters') | (data_frame['education'] == 'Doctorate')) &
    (data_frame['salary'] == '>50K')
].count()/data_frame['salary'].count())*100
Solution5

10.706059396210192

In [41]:
#Percentage of people without the degree of Bachelors, Masters, or Doctorate who make more than 50K
Solution6 = (data_frame['salary'][
    ((data_frame['education'] != 'Bachelors') & (data_frame['education'] != 'Masters') & (data_frame['education'] != 'Doctorate')) &
    (data_frame['salary'] == '>50K')
].count()/data_frame['salary'].count())*100
Solution6

13.374896348392248

In [42]:
#The minimum number of hours a person works per week.
Solution7 = np.min(data_frame['hours-per-week'])
Solution7

1

In [43]:
#Percentage of the people who work the minimum number of hours per week and have a salary of more than 50K.
Solution8 = (data_frame['salary'][(data_frame['hours-per-week'].astype(object) == Solution7) & (data_frame['hours-per-week'][data_frame['salary'] == '>50K'])].astype(object).count())/(data_frame['age'].count())*100
Solution8

0.006142317496391388

In [44]:
#Country that has the highest percentage of people that earn more that 50K.
list4 = data_frame['native-country'].unique()
list5 = pd.Series(list4)
list6 = []
list7 = []
a=0
while a <= np.max(list5.index):
    x = ((data_frame['salary'][(data_frame['salary'] == '>50K') & (data_frame['native-country'] == list4[a])].count())/(data_frame['salary'][(data_frame['native-country'] == list4[a])].count()))*100
    list6.append(x)
    list7.append(list4[a])
    Series6 = pd.Series(list6, index = list7)
    df6 = pd.DataFrame(Series6, columns = ['Percentage'])
    a = a + 1
df6[df6['Percentage'] == np.max(df6)]

      Percentage
Iran   41.860465

In [45]:
#The most popular occupation for those who earn more than 50K in India.
list11 = []
for occ in data_frame['occupation']:
    occ = occ.strip()
    list11.append(occ)

data_frame['occupation'] = list11

Occupations = data_frame['occupation'].unique().tolist()
Index = pd.Series(data_frame['occupation'].unique())
list12 = []
list13 = []
b = 0
while b <= np.max(Index.index):
    y = data_frame['occupation'][(data_frame['occupation'] == Index[b]) & (data_frame['salary'] == '>50K') & (data_frame['native-country'] == 'India')].count()
    list12.append(y)
    list13.append(Index[b])
    Series12 = pd.Series(list12, index = list13)
    df7 = pd.DataFrame(Series12, columns = ['Number of people employed'])
    b = b + 1
df7[df7['Number of people employed'] == np.max(df7['Number of people employed'])]

                Number of people employed
Prof-specialty                         25